In [2]:
import pandas as pd

In [5]:
data_job = pd.read_csv('linkedin-jobs-africa.csv')

In [6]:
type (data_job)

pandas.core.frame.DataFrame

In [7]:
data_job.head ()

,title,company,description,onsite_remote,salary,location,criteria,posted_date,link
0,Data Analyst,NNC,We are looking for a passionate certified Data...,onsite,NaN,"Cairo, Cairo, Egypt","[{'مستوى الأقدمية': 'غير مطبق'}, {'نوع التوظيف...",2022-11-18,https://eg.linkedin.com/jobs/view/data-analyst...
1,Data Analyst,Watu Credit,"WATU is a focus-driven, customer-centric compa...",onsite,NaN,"Nairobi County, Kenya","[{'Seniority level': 'Associate'}, {'Employmen...",2022-11-01,https://ke.linkedin.com/jobs/view/data-analyst...
2,Data Analyst (Credit Risk),Kuda,Kuda is a fintech on a mission to make financi...,onsite,NaN,"Cape Town, Western Cape, South Africa","[{'Seniority level': 'Not Applicable'}, {'Empl...",2022-11-21,https://za.linkedin.com/jobs/view/data-analyst...
3,Data Analyst,Watu Credit,Role: Data AnalystReporting to: Data Analytics...,onsite,NaN,"Nairobi, Nairobi County, Kenya","[{'Seniority level': 'Mid-Senior level'}, {'Em...",2022-11-01,https://ke.linkedin.com/jobs/view/data-analyst...
4,Data Analyst,Tata Consultancy Services,About Tata Consultancy ServicesTata Consultanc...,onsite,NaN,"City of Johannesburg, Gauteng, South Africa","[{'Seniority level': 'Mid-Senior level'}, {'Em...",2022-10-27,https://za.linkedin.com/jobs/view/data-analyst...

In [1]:
#obtaining data from scratch
import pandas as pd

In [11]:
url_link = "https://en.wikipedia.org/wiki/List_of_highest-grossing_Nigerian_films"

In [12]:
movie_data = pd.read_html(url_link)

In [13]:
type (movie_data)

list

In [14]:
len(movie_data)

8

In [15]:
movie_data[0]

,Rank,Title,Year,Domestic Gross,Studio(s),Director(s)
0,1,A Tribe Called Judah,2023,"₦1,398,872,790[1]",Funke Ayotunde Akindele Network,"Funke Akindele, Adeoluwa Owu"
1,2,Battle on Buka Street,2022,"₦668,423,056[2]",Funke Ayotunde Akindele Network / FilmOne,"Funke Akindele, Tobi Makinde"
2,3,Omo Ghetto: The Saga,2020,"₦636,129,120[3]",SceneOne Productions,Funke Akindele. JJC Skillz
3,4,The Wedding Party,2016,"₦452,288,605[4]",Ebonylife Films / FilmOne / Inkblot Production...,Kemi Adetiba
4,5,The Wedding Party 2,2017,"₦433,197,377[5]",Ebonylife Films / FilmOne / Inkblot Production...,Niyi Akinmolayan
...,...,...,...,...,...,...
97,98,Lara and the Beat,2018,"₦30,693,143[46]",Biola Alabi Media,Tosin Coker
98,99,Elevator Baby,2019,"₦30,595,550[21]",Anthill Studios,Akay Mason
99,100,The Bride Price,2023,"₦30,585,205",AstraTv Africa,Ikechukwu Oku
100,101,The Perfect Arrangement,2022,"₦30,515,400[8]",Inkblot Productions,Chinaza Onuzu
101,102,Muna,2019,"₦30,456,996[61]",KevStel Productions,Kevin Nwankwor

In [16]:
movie_data = movie_data [0]

In [17]:
type(movie_data)

pandas.core.frame.DataFrame

In [18]:
movie_data.head()

,Rank,Title,Year,Domestic Gross,Studio(s),Director(s)
0,1,A Tribe Called Judah,2023,"₦1,398,872,790[1]",Funke Ayotunde Akindele Network,"Funke Akindele, Adeoluwa Owu"
1,2,Battle on Buka Street,2022,"₦668,423,056[2]",Funke Ayotunde Akindele Network / FilmOne,"Funke Akindele, Tobi Makinde"
2,3,Omo Ghetto: The Saga,2020,"₦636,129,120[3]",SceneOne Productions,Funke Akindele. JJC Skillz
3,4,The Wedding Party,2016,"₦452,288,605[4]",Ebonylife Films / FilmOne / Inkblot Production...,Kemi Adetiba
4,5,The Wedding Party 2,2017,"₦433,197,377[5]",Ebonylife Films / FilmOne / Inkblot Production...,Niyi Akinmolayan

# writing an import statement

In [19]:
import pandas as pd

In [20]:
url_link = "https://en.wikipedia.org/wiki/List_of_highest-grossing_Nigerian_films"

In [21]:
movie_data = pd.read_html(url_link) #creating a dataframe

In [22]:
#data collected from wikipedia becomes a list after running the above.

In [23]:
len(movie_data)

8

In [24]:
movie_data = movie_data[0]

In [25]:
movie_data

,Rank,Title,Year,Domestic Gross,Studio(s),Director(s)
0,1,A Tribe Called Judah,2023,"₦1,398,872,790[1]",Funke Ayotunde Akindele Network,"Funke Akindele, Adeoluwa Owu"
1,2,Battle on Buka Street,2022,"₦668,423,056[2]",Funke Ayotunde Akindele Network / FilmOne,"Funke Akindele, Tobi Makinde"
2,3,Omo Ghetto: The Saga,2020,"₦636,129,120[3]",SceneOne Productions,Funke Akindele. JJC Skillz
3,4,The Wedding Party,2016,"₦452,288,605[4]",Ebonylife Films / FilmOne / Inkblot Production...,Kemi Adetiba
4,5,The Wedding Party 2,2017,"₦433,197,377[5]",Ebonylife Films / FilmOne / Inkblot Production...,Niyi Akinmolayan
...,...,...,...,...,...,...
97,98,Lara and the Beat,2018,"₦30,693,143[46]",Biola Alabi Media,Tosin Coker
98,99,Elevator Baby,2019,"₦30,595,550[21]",Anthill Studios,Akay Mason
99,100,The Bride Price,2023,"₦30,585,205",AstraTv Africa,Ikechukwu Oku
100,101,The Perfect Arrangement,2022,"₦30,515,400[8]",Inkblot Productions,Chinaza Onuzu
101,102,Muna,2019,"₦30,456,996[61]",KevStel Productions,Kevin Nwankwor

In [26]:
type(movie_data)

pandas.core.frame.DataFrame

In [27]:
#why is the number of my data not correlating with what i can see

In [28]:
movie_data.head() #A data frame!

,Rank,Title,Year,Domestic Gross,Studio(s),Director(s)
0,1,A Tribe Called Judah,2023,"₦1,398,872,790[1]",Funke Ayotunde Akindele Network,"Funke Akindele, Adeoluwa Owu"
1,2,Battle on Buka Street,2022,"₦668,423,056[2]",Funke Ayotunde Akindele Network / FilmOne,"Funke Akindele, Tobi Makinde"
2,3,Omo Ghetto: The Saga,2020,"₦636,129,120[3]",SceneOne Productions,Funke Akindele. JJC Skillz
3,4,The Wedding Party,2016,"₦452,288,605[4]",Ebonylife Films / FilmOne / Inkblot Production...,Kemi Adetiba
4,5,The Wedding Party 2,2017,"₦433,197,377[5]",Ebonylife Films / FilmOne / Inkblot Production...,Niyi Akinmolayan

In [29]:
#For a series
movie_data ['Title'].head()

0     A Tribe Called Judah
1    Battle on Buka Street
2     Omo Ghetto: The Saga
3        The Wedding Party
4      The Wedding Party 2
Name: Title, dtype: object

In [35]:
MD_Series = movie_data ['Year'].head()

In [36]:
type(MD_Series)

pandas.core.series.Series

In [37]:
movie_data.head(10)

,Rank,Title,Year,Domestic Gross,Studio(s),Director(s)
0,1,A Tribe Called Judah,2023,"₦1,398,872,790[1]",Funke Ayotunde Akindele Network,"Funke Akindele, Adeoluwa Owu"
1,2,Battle on Buka Street,2022,"₦668,423,056[2]",Funke Ayotunde Akindele Network / FilmOne,"Funke Akindele, Tobi Makinde"
2,3,Omo Ghetto: The Saga,2020,"₦636,129,120[3]",SceneOne Productions,Funke Akindele. JJC Skillz
3,4,The Wedding Party,2016,"₦452,288,605[4]",Ebonylife Films / FilmOne / Inkblot Production...,Kemi Adetiba
4,5,The Wedding Party 2,2017,"₦433,197,377[5]",Ebonylife Films / FilmOne / Inkblot Production...,Niyi Akinmolayan
5,6,Chief Daddy,2018,"₦387,540,749[6]",EbonyLife Films,Niyi Akinmolayan
6,7,Brotherhood,2022,"₦328,881,120[7]",Greoh Studios,Loukman Ali
7,8,King of Thieves,2022,"₦320,805,150[8]",Euphoria360 Media / Anthill Studios,"Tope Adebayo, Adebayo Tijani"
8,9,Malaika,2023,"₦301,123,775",Toyin Abraham Films Production,Steve Sodiya
9,10,Sugar Rush,2019,"₦287,053,270 [9]",GreoH Media / Jungle Filmworks / Empire Mates ...,Kayode Kasum

In [38]:
movie_data.tail(10)

,Rank,Title,Year,Domestic Gross,Studio(s),Director(s)
92,93,"Lust, Love and Other Things",2023,"₦31,962,243",Solo / Mswitch,Kayode Kasum
93,94,Still Falling,2021,"₦31,450,600[58]",Entertainment tru Christ,Dimbo Atiya
94,95,Love Is War,2019,"₦31,250,032[21]",Inkblot Production,Omoni Oboli
95,96,Gold Statue,2019,"₦30,986,552[21]",FilmOne Distribution,Tade Ogidan
96,97,Phone Swap,2012,"₦30,713,500,[59][60]",Golden Effects,Kunle Afolayan
97,98,Lara and the Beat,2018,"₦30,693,143[46]",Biola Alabi Media,Tosin Coker
98,99,Elevator Baby,2019,"₦30,595,550[21]",Anthill Studios,Akay Mason
99,100,The Bride Price,2023,"₦30,585,205",AstraTv Africa,Ikechukwu Oku
100,101,The Perfect Arrangement,2022,"₦30,515,400[8]",Inkblot Productions,Chinaza Onuzu
101,102,Muna,2019,"₦30,456,996[61]",KevStel Productions,Kevin Nwankwor

In [39]:
movie_data.columns #this helps to know the column heading of your data frame

Index(['Rank', 'Title', 'Year', 'Domestic Gross', 'Studio(s)', 'Director(s)'], dtype='object')

In [41]:
movie_data['Rank']. head()

0    1
1    2
2    3
3    4
4    5
Name: Rank, dtype: int64

In [42]:
#creating a dataframe from a list
lst_names = ['Yomi', 'Miriam', 'Martins', 'Rasheedat']

In [43]:
names = pd.DataFrame(data= lst_names, columns = ['Names'])

In [44]:
type(names)

pandas.core.frame.DataFrame

In [45]:
names #Lovely using google searching 'creating a dataframe with a python list'

       Names
0       Yomi
1     Miriam
2    Martins
3  Rasheedat

In [61]:
#creating a list with a dictionary
names_dict = {'Names': ['Rasheedat','Khadijah', 'Majeedat'], # Define dictionary
  'Age' : [24, 26, '25'],
  'City' : ['Abuja', 'Ibadan', 'Kaduna'], 'Skill': ['Data Scientist', 'Business Analyst', 'Frontend Engineer']}

In [62]:
names_data = pd.DataFrame(data= names_dict, columns = ['Names', 'Age', 'City', 'Skill'])

In [63]:
names_data

       Names Age    City              Skill
0  Rasheedat  24   Abuja     Data Scientist
1   Khadijah  26  Ibadan   Business Analyst
2   Majeedat  25  Kaduna  Frontend Engineer

In [64]:
#retrieveing data using columns or sequence
names_data.iloc[0]

Names         Rasheedat
Age                  24
City              Abuja
Skill    Data Scientist
Name: 0, dtype: object

In [65]:
#absolutely lovely
#Retrieving information by calling out datatype
names_data.dtypes

Names    object
Age      object
City     object
Skill    object
dtype: object

# Inserting/deleting Data Frame

In [66]:
names_data

       Names Age    City              Skill
0  Rasheedat  24   Abuja     Data Scientist
1   Khadijah  26  Ibadan   Business Analyst
2   Majeedat  25  Kaduna  Frontend Engineer

In [67]:
names_data.size

12

In [68]:
names_data.shape

(3, 4)

In [74]:
#insert a row
#1. create a series
add = pd.Series(data=['Maryam', 24, 'Malaysia', 'Fashion Stylist'], index=names_data.columns, name=3)

In [75]:
add

Names             Maryam
Age                   24
City            Malaysia
Skill    Fashion Stylist
Name: 3, dtype: object

In [77]:
#add as a row
names_data= pd.concat([names_data,add.to_frame().T], ignore_index= True)

In [78]:
names_data

       Names Age      City              Skill
0  Rasheedat  24     Abuja     Data Scientist
1   Khadijah  26    Ibadan   Business Analyst
2   Majeedat  25    Kaduna  Frontend Engineer
3     Maryam  24  Malaysia    Fashion Stylist

In [82]:
# Assuming names_data is your DataFrame and 'Maryam' is the index of the row you want to add to
names_data.loc[4] = ['Maryam', 24, 'Malaysia', 'Fashion Stylist']

In [83]:
names_data

            Names Age      City              Skill
0       Rasheedat  24     Abuja     Data Scientist
1        Khadijah  26    Ibadan   Business Analyst
2        Majeedat  25    Kaduna  Frontend Engineer
3          Maryam  24  Malaysia    Fashion Stylist
Maryam     Maryam  24  Malaysia    Fashion Stylist
4          Maryam  24  Malaysia    Fashion Stylist

In [ ]:
# Assuming names_data is your DataFrame and 'Maryam' is the index of the row you want to add to
#names_data.loc['Maryam'] = ['Maryam', 24, 'Malaysia', 'Fashion Stylist']

# Assuming you want to add the same data to multiple rows
# rows_to_add = ['Maryam', 'John', 'Jane']
# names_data.loc[rows_to_add] = ['Maryam', 24, 'Malaysia', 'Fashion Stylist']

In [84]:
names_data = names_data.drop('Maryam')

In [85]:
names_data

       Names Age      City              Skill
0  Rasheedat  24     Abuja     Data Scientist
1   Khadijah  26    Ibadan   Business Analyst
2   Majeedat  25    Kaduna  Frontend Engineer
3     Maryam  24  Malaysia    Fashion Stylist
4     Maryam  24  Malaysia    Fashion Stylist

In [ ]:
# rows_to_remove = ['Maryam', 'John', 'Jane']  # List of row index labels to remove
# names_data = names_data.drop(rows_to_remove)

In [86]:
names_data = names_data.drop([3,4])

In [87]:
names_data

       Names Age    City              Skill
0  Rasheedat  24   Abuja     Data Scientist
1   Khadijah  26  Ibadan   Business Analyst
2   Majeedat  25  Kaduna  Frontend Engineer

In [88]:
names_data.loc[3] = ['Maryam', 24, 'Malaysia', 'Fashion Stylist']

In [89]:
names_data

       Names Age      City              Skill
0  Rasheedat  24     Abuja     Data Scientist
1   Khadijah  26    Ibadan   Business Analyst
2   Majeedat  25    Kaduna  Frontend Engineer
3     Maryam  24  Malaysia    Fashion Stylist

In [ ]:
#adding a column
#Assuming 'new_column_data' is a list or array containing the values you want to add to the new column
# names_data ['New_Column_Name'] = new_column_data
#for example, you want to add age_group column
#names_data ['Age_Group'] = ['Young', 'Middle-Aged', 'Young', 'Young', 'Middle-Aged']

#To remove
# Assuming 'column_name' is the name of the column you want to remove
# names_data = names_data.drop('column_name', axis=1)
#For example
# names_data = names_data.drop('Age_Group', axis=1)

In [90]:
#Adding a column
names_data ['Religion'] = ['Muslim', 'Muslim', 'Muslim', 'Muslim']

In [91]:
names_data

       Names Age      City              Skill Religion
0  Rasheedat  24     Abuja     Data Scientist   Muslim
1   Khadijah  26    Ibadan   Business Analyst   Muslim
2   Majeedat  25    Kaduna  Frontend Engineer   Muslim
3     Maryam  24  Malaysia    Fashion Stylist   Muslim

In [ ]:
# to make changes to the column I just added without removing it
# Assuming 'new_age_values' is a list or array containing the new age group values
# names_data['Age_Group'] = new_age_values

In [92]:
#To remove
names_data = names_data.drop('Religion', axis=1)

In [93]:
names_data

       Names Age      City              Skill
0  Rasheedat  24     Abuja     Data Scientist
1   Khadijah  26    Ibadan   Business Analyst
2   Majeedat  25    Kaduna  Frontend Engineer
3     Maryam  24  Malaysia    Fashion Stylist

In [ ]:
# Replace 'column_name' with the name of the column you want to remove. 
# The axis=1 parameter specifies that you're removing a column (as opposed to a row, which would be axis=0). 
# After executing this line of code, the specified column will be permanently removed from the DataFrame names_data. 
# Make sure to reassign the result back to names_data if you want the changes to be permanent.

In [94]:
names_data = names_data.drop(3)

In [95]:
names_data

       Names Age    City              Skill
0  Rasheedat  24   Abuja     Data Scientist
1   Khadijah  26  Ibadan   Business Analyst
2   Majeedat  25  Kaduna  Frontend Engineer

# Data Cleaning

In [4]:
#creating data from scratch
url_link_1 = "https://en.wikipedia.org/wiki/List_of_largest_companies_by_revenue"

In [5]:
import pandas as pd
company_data = pd.read_html(url_link_1)

In [7]:
type (company_data)

list

In [8]:
company_data = company_data[0] #dataframe

In [9]:
company_data.head ()

,Rank,Name,Industry,Revenue,Profit,Employees,Headquarters[note 1],State-owned,Ref.,Unnamed: 9_level_0
,Rank,Name,Industry,USD millions,USD millions,Employees,Headquarters[note 1],State-owned,Unnamed: 8_level_1,Revenue per worker
0,1,Walmart,Retail,"$611,289","$11,680",2100000,United States,NaN,[1],"$291,090.00"
1,2,Saudi Aramco,Oil and gas,"$603,651","$159,069",70496,Saudi Arabia,NaN,[4],"$8,562,911.37"
2,3,Amazon,Retail,"$574,785","$30,425",1525000,United States,NaN,[5],"$376,908"
3,4,State Grid Corporation of China,Electricity,"$530,009","$8,192",870287,China,NaN,[6],"$609,004.85"
4,5,Vitol,Commodities,"$505,000","$15,000",1560,Switzerland,NaN,[7][8],"$323,717,948.72"

In [8]:
company_data.columns

MultiIndex([(                'Rank',                 'Rank'),
            (                'Name',                 'Name'),
            (            'Industry',             'Industry'),
            (             'Revenue',         'USD millions'),
            (              'Profit',         'USD millions'),
            (           'Employees',            'Employees'),
            ('Headquarters[note 1]', 'Headquarters[note 1]'),
            (         'State-owned',          'State-owned'),
            (                'Ref.',   'Unnamed: 8_level_1'),
            (  'Unnamed: 9_level_0',   'Revenue per worker')],
           )

In [9]:
movie_data.columns

NameError: name 'movie_data' is not defined

In [10]:
company_data.columns = company_data.columns.get_level_values(0) #changing multiindex to single index

In [11]:
company_data.head()

,Rank,Name,Industry,Revenue,Profit,Employees,Headquarters[note 1],State-owned,Ref.,Unnamed: 9_level_0
0,1,Walmart,Retail,"$611,289","$11,680",2100000,United States,NaN,[1],"$291,090.00"
1,2,Saudi Aramco,Oil and gas,"$603,651","$159,069",70496,Saudi Arabia,NaN,[4],"$8,562,911.37"
2,3,Amazon,Retail,"$574,785","$30,425",1525000,United States,NaN,[5],"$376,908"
3,4,State Grid Corporation of China,Electricity,"$530,009","$8,192",870287,China,NaN,[6],"$609,004.85"
4,5,Vitol,Commodities,"$505,000","$15,000",1560,Switzerland,NaN,[7][8],"$323,717,948.72"

In [15]:
company_data.columns

Index(['Rank', 'Name', 'Industry', 'Revenue', 'Profit', 'Employees',
       'Headquarters[note 1]', 'State-owned', 'Ref.', 'Unnamed: 9_level_0'],
      dtype='object')

In [45]:
#dropping a column
company_data.drop (columns= ['Ref.'], axis=1, inplace = True)

In [46]:
company_data.head()

,Ranking,Company Name,Industry,Revenue,Profit,Employees,Headquarters,State-owned,Unnamed: 9_level_0
0,1,Walmart,Retail,"$611,289","$11,680",2100000,United States,NaN,"$291,090.00"
1,2,Saudi Aramco,Oil and gas,"$603,651","$159,069",70496,Saudi Arabia,NaN,"$8,562,911.37"
2,3,Amazon,Retail,"$574,785","$30,425",1525000,United States,NaN,"$376,908"
3,4,State Grid Corporation of China,Electricity,"$530,009","$8,192",870287,China,NaN,"$609,004.85"
4,5,Vitol,Commodities,"$505,000","$15,000",1560,Switzerland,NaN,"$323,717,948.72"

In [36]:
#Renaming Column labels
company_data.columns

Index(['Rank', 'Name', 'Industry', 'Revenue', 'Profit', 'Employees',
       'Headquarters[note 1]', 'State-owned', 'Ref.', 'Unnamed: 9_level_0'],
      dtype='object')

In [19]:
#Intermisson
#pandas.DataFrame.drop
#DataFrame.drop(labels=None, *, axis=0, index=None, columns=None, level=None, inplace=False, errors='raise')[source]

In [12]:
company_data.rename(columns={"Rank": "Ranking",
                   "Name": "Company Name", "Headquarters[note 1]" : "Headquarters"},
          inplace=True)

In [13]:
print(type(company_data))

<class 'pandas.core.frame.DataFrame'>

In [39]:
company_data.head()

,Ranking,Company Name,Industry,Revenue,Profit,Employees,Headquarters,State-owned,Ref.,Unnamed: 9_level_0
0,1,Walmart,Retail,"$611,289","$11,680",2100000,United States,NaN,[1],"$291,090.00"
1,2,Saudi Aramco,Oil and gas,"$603,651","$159,069",70496,Saudi Arabia,NaN,[4],"$8,562,911.37"
2,3,Amazon,Retail,"$574,785","$30,425",1525000,United States,NaN,[5],"$376,908"
3,4,State Grid Corporation of China,Electricity,"$530,009","$8,192",870287,China,NaN,[6],"$609,004.85"
4,5,Vitol,Commodities,"$505,000","$15,000",1560,Switzerland,NaN,[7][8],"$323,717,948.72"

In [47]:
#summarising data
company_data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 50 entries, 0 to 49
Data columns (total 9 columns):
 #   Column              Non-Null Count  Dtype
---  ------              --------------  -----
 0   Ranking             50 non-null     int64
 1   Company Name        50 non-null     object
 2   Industry            50 non-null     object
 3   Revenue             50 non-null     object
 4   Profit              50 non-null     object
 5   Employees           50 non-null     int64
 6   Headquarters        50 non-null     object
 7   State-owned         0 non-null      float64
 8   Unnamed: 9_level_0  50 non-null     object
dtypes: float64(1), int64(2), object(6)
memory usage: 3.6+ KB

In [48]:
#Take a closer look at Rev. column
company_data['Revenue'].head(2)

0    $611,289
1    $603,651
Name: Revenue, dtype: object

In [14]:
#remove the dollar sign from the revenue column
company_data['Revenue'] = company_data['Revenue'].str.replace('$','')

In [50]:
company_data.head()

,Ranking,Company Name,Industry,Revenue,Profit,Employees,Headquarters,State-owned,Unnamed: 9_level_0
0,1,Walmart,Retail,"611,289","$11,680",2100000,United States,NaN,"$291,090.00"
1,2,Saudi Aramco,Oil and gas,"603,651","$159,069",70496,Saudi Arabia,NaN,"$8,562,911.37"
2,3,Amazon,Retail,"574,785","$30,425",1525000,United States,NaN,"$376,908"
3,4,State Grid Corporation of China,Electricity,"530,009","$8,192",870287,China,NaN,"$609,004.85"
4,5,Vitol,Commodities,"505,000","$15,000",1560,Switzerland,NaN,"$323,717,948.72"

In [51]:
company_data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 50 entries, 0 to 49
Data columns (total 9 columns):
 #   Column              Non-Null Count  Dtype
---  ------              --------------  -----
 0   Ranking             50 non-null     int64
 1   Company Name        50 non-null     object
 2   Industry            50 non-null     object
 3   Revenue             50 non-null     object
 4   Profit              50 non-null     object
 5   Employees           50 non-null     int64
 6   Headquarters        50 non-null     object
 7   State-owned         0 non-null      float64
 8   Unnamed: 9_level_0  50 non-null     object
dtypes: float64(1), int64(2), object(6)
memory usage: 3.6+ KB

In [15]:
company_data['Profit'] = company_data['Profit'].str.replace('$','')

In [54]:
company_data.head()

,Ranking,Company Name,Industry,Revenue,Profit,Employees,Headquarters,State-owned,Unnamed: 9_level_0
0,1,Walmart,Retail,"611,289","11,680",2100000,United States,NaN,"$291,090.00"
1,2,Saudi Aramco,Oil and gas,"603,651","159,069",70496,Saudi Arabia,NaN,"$8,562,911.37"
2,3,Amazon,Retail,"574,785","30,425",1525000,United States,NaN,"$376,908"
3,4,State Grid Corporation of China,Electricity,"530,009","8,192",870287,China,NaN,"$609,004.85"
4,5,Vitol,Commodities,"505,000","15,000",1560,Switzerland,NaN,"$323,717,948.72"

In [16]:
company_data.drop(columns= ['Unnamed: 9_level_0'], axis=1, inplace = True)

In [59]:
company_data.head()

,Ranking,Company Name,Industry,Revenue,Profit,Employees,Headquarters,State-owned
0,1,Walmart,Retail,"611,289","11,680",2100000,United States,NaN
1,2,Saudi Aramco,Oil and gas,"603,651","159,069",70496,Saudi Arabia,NaN
2,3,Amazon,Retail,"574,785","30,425",1525000,United States,NaN
3,4,State Grid Corporation of China,Electricity,"530,009","8,192",870287,China,NaN
4,5,Vitol,Commodities,"505,000","15,000",1560,Switzerland,NaN

In [17]:
company_data['Revenue'] = company_data['Revenue'].str.replace(',','')

In [62]:
company_data.head()

,Ranking,Company Name,Industry,Revenue,Profit,Employees,Headquarters,State-owned
0,1,Walmart,Retail,611289,"11,680",2100000,United States,NaN
1,2,Saudi Aramco,Oil and gas,603651,"159,069",70496,Saudi Arabia,NaN
2,3,Amazon,Retail,574785,"30,425",1525000,United States,NaN
3,4,State Grid Corporation of China,Electricity,530009,"8,192",870287,China,NaN
4,5,Vitol,Commodities,505000,"15,000",1560,Switzerland,NaN

In [63]:
company_data['Profit'] = company_data['Profit'].str.replace(',','')

In [67]:
company_data.head()

,Ranking,Company Name,Industry,Revenue,Profit,Employees,Headquarters,State-owned
0,1,Walmart,Retail,611289,11680,2100000,United States,NaN
1,2,Saudi Aramco,Oil and gas,603651,159069,70496,Saudi Arabia,NaN
2,3,Amazon,Retail,574785,30425,1525000,United States,NaN
3,4,State Grid Corporation of China,Electricity,530009,8192,870287,China,NaN
4,5,Vitol,Commodities,505000,15000,1560,Switzerland,NaN

In [68]:
company_data.columns

Index(['Ranking', 'Company Name', 'Industry', 'Revenue', 'Profit', 'Employees',
       'Headquarters', 'State-owned'],
      dtype='object')

In [69]:
company_data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 50 entries, 0 to 49
Data columns (total 8 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   Ranking       50 non-null     int64
 1   Company Name  50 non-null     object
 2   Industry      50 non-null     object
 3   Revenue       50 non-null     object
 4   Profit        50 non-null     object
 5   Employees     50 non-null     int64
 6   Headquarters  50 non-null     object
 7   State-owned   0 non-null      float64
dtypes: float64(1), int64(2), object(5)
memory usage: 3.3+ KB

In [18]:
#Renaming column for Rev. & Profit
company_data.rename(columns={"Revenue": "Revenue ($)",
                   "Profit": "Profit ($)"}, inplace =True)

In [72]:
#converting to float
#df["data"] = df["data"].astype(float)

In [19]:
company_data["Revenue ($)"] = company_data["Revenue ($)"].astype(float)

In [20]:
company_data ['Revenue ($)'].unique() #to check unique data

array([611289., 603651., 574785., 530009., 505000., 483019., 471154.,
       413680., 394328., 386201., 324162., 322467., 318476., 305885.,
       302089., 293685., 288309., 282836., 276711., 274491., 263310.,
       255984., 248891., 246252., 238587., 234129., 226954., 222535.,
       214766., 211915., 202753., 188888., 187061., 181566., 181364.,
       180516., 180012., 175702., 173834., 171669., 171189., 167832.,
       165000., 164762., 163037., 161698., 159800., 159371., 158057.,
       157403.])

In [82]:
company_data ['Profit ($)'].unique()

array(['11680', '159069', '30425', '8192', '15000', '21080', '9657',
       '55740', '99803', '20120', '4149', '6994', '4234', '−22819',
       '15233', '−19961', '59972', '3560', '18110', '20526', '17320',
       '−2487', '35465', '1699', '42398', '5844', '4751', '53589',
       '73307', '48145', '17669', '38524', '12454', '−933', '6668',
       '14516', '11024', '–1', '2035', '11528', '17641', '...', '16988',
       '1800', '2493', '8723', '−1981', '15252'], dtype=object)

In [86]:
company_data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 50 entries, 0 to 49
Data columns (total 8 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   Ranking       50 non-null     int64
 1   Company Name  50 non-null     object
 2   Industry      50 non-null     object
 3   Revenue ($)   50 non-null     float64
 4   Profit ($)    50 non-null     object
 5   Employees     50 non-null     int64
 6   Headquarters  50 non-null     object
 7   State-owned   0 non-null      float64
dtypes: float64(2), int64(2), object(4)
memory usage: 3.3+ KB

In [135]:
#company_data["Profit ($)"] = company_data["Profit ($)"].str.replace("<NA>", "")

In [32]:
#company_data["Profit ($)"].replace('', pd.NA, inplace=True)

In [22]:
company_data.dropna(subset=['Profit ($)'], inplace=True)

In [33]:
company_data ["Profit ($)"].unique()

array(['11,680', '159,069', '30,425', '8,192', '15,000', '21,080',
       '9,657', '55,740', '99,803', '20,120', '4,149', '6,994', '4,234',
       '22,819', '15,233', '19,961', '59,972', '3,560', '18,110',
       '20,526', '17,320', '2,487', '35,465', '1,699', '42,398', '5,844',
       '4,751', '53,589', '73,307', '48,145', '17,669', '38,524',
       '12,454', '933', '6,668', '14,516', '11,024', '1', '2,035',
       '11,528', '17,641', <NA>, '16,988', '1,800', '2,493', '8,723',
       '1,981', '15,252'], dtype=object)

In [30]:
#company_data['Profit ($)'] = company_data['Profit ($)'].str.replace('11,680','')

In [37]:
company_data ["Profit ($)"].unique()

array(['11,680', '159,069', '30,425', '8,192', '15,000', '21,080',
       '9,657', '55,740', '99,803', '20,120', '4,149', '6,994', '4,234',
       '22,819', '15,233', '19,961', '59,972', '3,560', '18,110',
       '20,526', '17,320', '2,487', '35,465', '1,699', '42,398', '5,844',
       '4,751', '53,589', '73,307', '48,145', '17,669', '38,524',
       '12,454', '933', '6,668', '14,516', '11,024', '1', '2,035',
       '11,528', '17,641', '16,988', '1,800', '2,493', '8,723', '1,981',
       '15,252'], dtype=object)

In [42]:
company_data["Profit ($)"].replace('', pd.NA, inplace=True)

In [43]:
company_data.dropna(subset=['Profit ($)'], inplace=True)

In [39]:
company_data['Profit ($)'] = company_data['Profit ($)'].str.replace('11,680','')

In [44]:
company_data ["Profit ($)"].unique()

array(['159,069', '30,425', '8,192', '15,000', '21,080', '9,657',
       '55,740', '99,803', '20,120', '4,149', '6,994', '4,234', '22,819',
       '15,233', '19,961', '59,972', '3,560', '18,110', '20,526',
       '17,320', '2,487', '35,465', '1,699', '42,398', '5,844', '4,751',
       '53,589', '73,307', '48,145', '17,669', '38,524', '12,454', '933',
       '6,668', '14,516', '11,024', '1', '2,035', '11,528', '17,641',
       '16,988', '1,800', '2,493', '8,723', '1,981', '15,252'],
      dtype=object)

In [ ]:
company_data.info()

In [46]:
#company_data.head()

In [47]:
#filtering company_data.head()